{
  "products": [
    {
      "category_id": 1,
      "product_type": "เนื้อหมู",
      "types": [
        {
          "type_id": 1,
          "category_id": 1,
          "type_name": "สามชั้น",
          "product_items": [
            {
              "product_item_id": 1,
              "type_id": 1,
              "product_name": "สามชั้นสไลด์",
              "description": "เนื้อหมูสามชั้นคุณภาพดี หั่นบางพอดีคำ เหมาะสำหรับย่าง ทอด หรือผัด ให้รสสัมผัสนุ่มฉ่ำ อร่อยทุกคำ เต็มรสชาติความอร่อยของมันหมู",
              "product_size": 1000,
              "price": 179,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 2,
          "category_id": 1,
          "type_name": "สันคอ",
          "product_items": [
            {
              "product_item_id": 2,
              "type_id": 2,
              "product_name": "สันคอสไลด์",
              "description": "เนื้อหมูสันคอคัดพิเศษ หั่นบางสม่ำเสมอ เนื้อนุ่ม มีมันแทรกพอดี ให้รสชาติกลมกล่อม เหมาะสำหรับย่าง ปิ้ง หรือทำหมูกระทะ อร่อยได้ในทุกเมนู",
              "product_size": 1000,
              "price": 146,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 3,
          "category_id": 1,
          "type_name": "สันนอก",
          "product_items": [
            {
              "product_item_id": 3,
              "type_id": 3,
              "product_name": "สันนอกสไลด์",
              "description": "เนื้อหมูสันนอกคุณภาพเยี่ยม หั่นบางพอดี เนื้อแน่น รสชาติดี ไขมันน้อย เหมาะสำหรับผู้รักสุขภาพ ทำอาหารได้หลากหลาย ทั้งผัด ต้ม หรือย่าง ให้รสสัมผัสนุ่มอร่อย",
              "product_size": 1000,
              "price": 139,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 4,
          "category_id": 1,
          "type_name": "สะโพก",
          "product_items": [
            {
              "product_item_id": 4,
              "type_id": 4,
              "product_name": "สะโพกสไลด์",
              "description": "เนื้อหมูสะโพกคุณภาพดี หั่นบางสม่ำเสมอ เนื้อแน่น ไขมันน้อย เหมาะสำหรับทำอาหารได้หลากหลาย โดยเฉพาะเมนูผัดหรือต้ม ให้รสชาติดี เนื้อนุ่ม ไม่เหนียว",
              "product_size": 1000,
              "price": 129,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 5,
          "category_id": 1,
          "type_name": "ไหล่",
          "product_items": [
            {
              "product_item_id": 5,
              "type_id": 5,
              "product_name": "ไหล่สไลด์",
              "description": "เนื้อหมูไหล่คัดพิเศษ หั่นบางพอดีคำ เนื้อนุ่ม มีมันแทรกเล็กน้อย ให้รสชาติกลมกล่อม เหมาะสำหรับทำอาหารได้หลากหลาย ทั้งผัด ทอด หรือย่าง อร่อยทุกเมนู",
              "product_size": 1000,
              "price": 119,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 6,
          "category_id": 1,
          "type_name": "เครื่องใน",
          "product_items": [
            {
              "product_item_id": 6,
              "type_id": 6,
              "product_name": "ตับสไลด์",
              "description": "ตับหมูคุณภาพดี สด สะอาด หั่นบางพอดีคำ รสชาติดี อุดมไปด้วยสารอาหาร โดยเฉพาะธาตุเหล็ก เหมาะสำหรับผัดหรือทอด ให้รสสัมผัสนุ่มเนียน อร่อยถูกปาก",
              "product_size": 1000,
              "price": 55,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 7,
              "type_id": 6,
              "product_name": "เซียงจี้สไลด์",
              "description": "เซียงจี้หมูคุณภาพดี สด สะอาด หั่นบางพอดีคำ รสชาติเฉพาะตัว อุดมไปด้วยคอลลาเจน เหมาะสำหรับต้มหรือผัด ให้รสสัมผัสกรุบกรอบ อร่อยแปลกใหม่",
              "product_size": 1000,
              "price": 55,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 8,
              "type_id": 6,
              "product_name": "มันแข็งหั่นเต๋า",
              "description": "มันแข็งหมูคุณภาพดี สด สะอาด หั่นเป็นลูกเต๋าพอดีคำ ให้รสชาติเฉพาะตัว เหมาะสำหรับทอดกรอบหรือใช้ผัดในอาหารต่างๆ เพิ่มความหอมมัน อร่อยกลมกล่อม",
              "product_size": 1000,
              "price": 60,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        }
      ]
    },
    {
      "category_id": 2,
      "product_type": "อาหารพร้อมปรุง",
      "types": [
        {
          "type_id": 7,
          "category_id": 2,
          "type_name": "เนื้อหมู",
          "product_items": [
            {
              "product_item_id": 9,
              "type_id": 7,
              "product_name": "หมูหมักนุ่ม",
              "description": "เนื้อหมูหมักพร้อมปรุงที่ผ่านกระบวนการหมักพิเศษ ทำให้เนื้อนุ่มและรสชาติกลมกล่อม เหมาะสำหรับการทำอาหารได้หลากหลายเมนู ไม่ว่าจะเป็นการย่าง ทอด หรือผัด สะดวกและประหยัดเวลาในการเตรียมอาหาร",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 10,
              "type_id": 7,
              "product_name": "หมูหมักน้ำมันงา",
              "description": "เนื้อหมูหมักน้ำมันงาคุณภาพดี ให้กลิ่นหอมเฉพาะตัวของงา เพิ่มรสชาติและความนุ่มให้กับเนื้อหมู เหมาะสำหรับการย่างหรือทอด ทำให้ได้อาหารที่มีกลิ่นหอมชวนรับประทาน และมีประโยชน์จากน้ำมันงาที่อุดมไปด้วยวิตามินอี",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 11,
              "type_id": 7,
              "product_name": "หมูหมักน้ำผึ้ง",
              "description": "เนื้อหมูหมักน้ำผึ้งแท้ ให้รสชาติหวานนุ่มกำลังดี เนื้อหมูจะมีความชุ่มฉ่ำและหอมหวาน เหมาะสำหรับการย่างหรืออบ ทำให้ได้อาหารที่มีรสชาติกลมกล่อม หวานนำเค็มตาม เป็นที่ถูกปากทั้งเด็กและผู้ใหญ่",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 12,
              "type_id": 7,
              "product_name": "หมูหมักบาร์บีคิว",
              "description": "เนื้อหมูหมักซอสบาร์บีคิวสูตรพิเศษ ให้รสชาติเข้มข้น หอมกลิ่นเครื่องเทศ เหมาะสำหรับการย่างหรืออบ ทำให้ได้อาหารสไตล์ตะวันตกที่มีรสชาติกลมกล่อม เนื้อนุ่ม ชุ่มฉ่ำด้วยซอส เป็นเมนูยอดนิยมสำหรับงานปาร์ตี้หรือการรับประทานในครอบครัว",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 13,
              "type_id": 7,
              "product_name": "หมูหมักหม่าล่า",
              "description": "เนื้อหมูหมักซอสหม่าล่าสูตรต้นตำรับ ให้รสชาติเผ็ดร้อน ชาลิ้น และมีกลิ่นหอมเฉพาะตัว เหมาะสำหรับผู้ที่ชื่นชอบอาหารรสจัด สามารถนำไปผัดหรือทอดได้ตามต้องการ ให้รสชาติแบบอาหารจีนเสฉวนแท้ๆ ที่ทั้งเผ็ดและหอมกลิ่นสมุนไพร",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 14,
              "type_id": 7,
              "product_name": "หมูหมักนุ่มปรุงรส",
              "description": "เนื้อหมูหมักนุ่มปรุงรสพิเศษ ผ่านกระบวนการหมักที่ทำให้เนื้อนุ่มและดูดซึมรสชาติได้ดี มีการปรุงรสที่ลงตัว ไม่เค็มหรือจืดเกินไป เหมาะสำหรับการทำอาหารได้หลากหลายเมนู ทั้งผัด ทอด หรือย่าง ให้รสชาติอร่อยโดยไม่ต้องปรุงเพิ่ม",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 15,
              "type_id": 7,
              "product_name": "สามชั้นหมักน้ำมันงา",
              "description": "เนื้อหมูสามชั้นคุณภาพดีหมักด้วยน้ำมันงา ให้ความหอมและรสชาติเฉพาะตัว เนื้อหมูสามชั้นมีความนุ่มและมันกำลังดี เมื่อนำไปย่างหรือทอดจะได้หนังกรอบและเนื้อนุ่มฉ่ำ หอมกลิ่นงา เหมาะสำหรับทำเมนูยอดนิยมอย่างหมูสามชั้นย่าง หรือหมูสามชั้นทอดน้ำปลา",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 16,
              "type_id": 7,
              "product_name": "สามชั้นหมักพริกไทยดำ",
              "description": "เนื้อหมูสามชั้นหมักพริกไทยดำเม็ดโต ให้รสชาติเผ็ดร้อนและหอมกรุ่น เนื้อหมูสามชั้นมีความนุ่มและฉ่ำมัน เมื่อนำไปย่างหรือทอดจะได้หนังกรอบและเนื้อนุ่ม มีกลิ่นหอมของพริกไทยดำที่ช่วยกระตุ้นความอยากอาหาร เหมาะสำหรับทำเมนูสไตล์ตะวันตกหรือฟิวชั่น",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 17,
              "type_id": 7,
              "product_name": "สามชั้นหมักบาร์บีคิว",
              "description": "เนื้อหมูสามชั้นหมักซอสบาร์บีคิวสูตรพิเศษ ให้รสชาติเข้มข้น หอมกลิ่นเครื่องเทศ เนื้อหมูสามชั้นมีความนุ่มและฉ่ำมัน เมื่อนำไปย่างหรืออบจะได้หนังกรอบและเนื้อนุ่ม เคลือบด้วยซอสบาร์บีคิวที่เข้มข้น เหมาะสำหรับทำเมนูปิ้งย่างในงานปาร์ตี้หรือรับประทานกับครอบครัว",
              "product_size": 1000,
              "price": 100,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 8,
          "category_id": 2,
          "type_name": "เนื้อไก่",
          "product_items": [
            {
              "product_item_id": 18,
              "type_id": 8,
              "product_name": "ไก่แซ่บ",
              "description": "เนื้อไก่หมักรสเผ็ดสไตล์อีสาน ใช้เครื่องเทศและสมุนไพรพื้นบ้านในการหมัก ให้รสชาติจัดจ้าน เผ็ดร้อน และมีกลิ่นหอมเฉพาะตัว เหมาะสำหรับนำไปย่างหรือทอด ทำให้ได้อาหารที่มีรสชาติเข้มข้น ถูกปากคนชอบอาหารรสจัด เป็นเมนูยอดนิยมสำหรับกับแกล้มหรืออาหารหลัก",
              "product_size": 1000,
              "price": 50,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 19,
              "type_id": 8,
              "product_name": "ไก่หมักน้ำมันงา",
              "description": "เนื้อไก่หมักน้ำมันงาคุณภาพดี ให้กลิ่นหอมเฉพาะตัวของงา ช่วยเพิ่มรสชาติและความนุ่มให้กับเนื้อไก่ เหมาะสำหรับการย่างหรือทอด ทำให้ได้อาหารที่มีกลิ่นหอมชวนรับประทาน และมีประโยชน์จากน้ำมันงาที่อุดมไปด้วยวิตามินอี เป็นตัวเลือกที่ดีสำหรับผู้รักสุขภาพ",
              "product_size": 1000,
              "price": 50,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 20,
              "type_id": 8,
              "product_name": "ไก่หมักพริกไทยดำ",
              "description": "เนื้อไก่หมักพริกไทยดำเม็ดโต ให้รสชาติเผ็ดร้อนและหอมกรุ่น เนื้อไก่มีความนุ่มและฉ่ำ เมื่อนำไปย่างหรือทอดจะได้เนื้อไก่ที่มีกลิ่นหอมของพริกไทยดำที่ช่วยกระตุ้นความอยากอาหาร เหมาะสำหรับทำเมนูสไตล์ตะวันตกหรือฟิวชั่น เป็นอาหารที่ให้โปรตีนสูงและรสชาติดี",
              "product_size": 1000,
              "price": 50,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 21,
              "type_id": 8,
              "product_name": "ไก่หมักน้ำผึ้ง",
              "description": "เนื้อไก่หมักน้ำผึ้งแท้ ให้รสชาติหวานนุ่มกำลังดี เนื้อไก่จะมีความชุ่มฉ่ำและหอมหวาน เหมาะสำหรับการย่างหรืออบ ทำให้ได้อาหารที่มีรสชาติกลมกล่อม หวานนำเค็มตาม เป็นที่ถูกปากทั้งเด็กและผู้ใหญ่ เมนูนี้ยังเหมาะสำหรับผู้ที่ต้องการรับประทานอาหารรสไม่จัดมากนัก",
              "product_size": 1000,
              "price": 50,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 22,
              "type_id": 8,
              "product_name": "ไก่หมักบาร์บีคิว",
              "description": "เนื้อไก่หมักซอสบาร์บีคิวสูตรพิเศษ ให้รสชาติเข้มข้น หอมกลิ่นเครื่องเทศ เหมาะสำหรับการย่างหรืออบ ทำให้ได้อาหารสไตล์ตะวันตกที่มีรสชาติกลมกล่อม เนื้อนุ่ม ชุ่มฉ่ำด้วยซอส เป็นเมนูยอดนิยมสำหรับงานปาร์ตี้หรือการรับประทานในครอบครัว สามารถทำเป็นเมนูง่ายๆ อย่างไก่บาร์บีคิวอบหรือย่าง",
              "product_size": 1000,
              "price": 50,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        },
        {
          "type_id": 9,
          "category_id": 2,
          "type_name": "เนื้อวัว",
          "product_items": [
            {
              "product_item_id": 23,
              "type_id": 9,
              "product_name": "เนื้อหมักนุ่ม",
              "description": "เนื้อวัวคุณภาพดีผ่านการหมักด้วยสูตรพิเศษที่ช่วยให้เนื้อนุ่มและรสชาติกลมกล่อม เหมาะสำหรับการย่าง ผัด หรือทำสเต็ก ช่วยลดเวลาในการเตรียมอาหารและรับประกันความอร่อย เนื้อมีความนุ่มและฉ่ำ เหมาะสำหรับทุกเพศทุกวัย โดยเฉพาะผู้ที่ชื่นชอบเนื้อวัวแต่กังวลเรื่องความเหนียว",
              "product_size": 1000,
              "price": 120,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 24,
              "type_id": 9,
              "product_name": "เนื้อหมักซอส",
              "description": "เนื้อวัวหมักซอสสูตรพิเศษที่ให้รสชาติเข้มข้น หอมกลิ่นเครื่องเทศ เหมาะสำหรับการย่าง ผัด หรือทำสเต็ก ซอสที่ใช้หมักช่วยเพิ่มรสชาติและทำให้เนื้อนุ่ม ชุ่มฉ่ำ เมื่อปรุงสุกจะได้อาหารที่มีรสชาติกลมกล่อม เป็นเมนูที่เหมาะสำหรับมื้อพิเศษหรืองานเลี้ยง สามารถนำไปประกอบอาหารได้หลากหลายรูปแบบ",
              "product_size": 1000,
              "price": 120,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 25,
              "type_id": 9,
              "product_name": "เนื้อหมักพริกไทยดำ",
              "description": "เนื้อวัวหมักพริกไทยดำเม็ดโต ให้รสชาติเผ็ดร้อนและหอมกรุ่น เนื้อวัวมีความนุ่มและฉ่ำ เมื่อนำไปย่างหรือทำสเต็กจะได้เนื้อที่มีกลิ่นหอมของพริกไทยดำที่ช่วยกระตุ้นความอยากอาหาร เหมาะสำหรับทำเมนูสเต็กสไตล์ตะวันตกหรือเมนูผัดพริกไทยดำ เป็นอาหารที่ให้โปรตีนสูงและรสชาติดี เหมาะสำหรับผู้ที่ชื่นชอบอาหารรสจัดและมีกลิ่นหอมเครื่องเทศ",
              "product_size": 1000,
              "price": 120,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        }
      ]
    },

    {
      "category_id": 3,
      "product_type": "ผลิตภัณฑ์แพ็คคู่",
      "types": [
        {
          "type_id": 10,
          "category_id": 3,
          "type_name": "เนื้อหมูสไลด์",
          "product_items": [
            {
              "product_item_id": 26,
              "type_id": 10,
              "product_name": "คู่รัก-หมูกระทะ",
              "description": "ชุดแพ็คคู่สุดคุ้มสำหรับคนรักหมูกระทะ ประกอบด้วยเนื้อหมูสามชั้นขุนและสันคอขุนคุณภาพดี เนื้อนุ่ม หอม อร่อย เหมาะสำหรับย่างบนกระทะร้อน ให้ได้กลิ่นหอมและรสชาติที่กลมกล่อม เนื้อหมูทั้งสองชนิดถูกคัดสรรมาอย่างดีเพื่อให้เข้ากันได้อย่างลงตัว เหมาะสำหรับการทานคู่กันหรือแบ่งปันกับคนที่คุณรัก ทำให้มื้ออาหารของคุณพิเศษยิ่งขึ้น",
              "product_size": 1000,
              "price": 116,
              "product_image": "https://fakeimg.pl/544x468/"
            },
            {
              "product_item_id": 27,
              "type_id": 10,
              "product_name": "คู่รัก-หมูชาบู",
              "description": "ชุดแพ็คคู่สำหรับคนรักหมูชาบู ประกอบด้วยเนื้อหมูสามชั้นขุนและสันคอขุนที่หั่นบางพิเศษ เหมาะสำหรับการลวกในน้ำซุปร้อนๆ เนื้อหมูทั้งสองชนิดมีความนุ่ม ฉ่ำ และรสชาติดี เมื่อลวกสุกจะได้เนื้อที่นุ่มละมุนลิ้น ดูดซับรสชาติน้ำซุปได้ดี ชุดนี้เหมาะสำหรับการทานคู่กันหรือแบ่งปันในมื้อชาบูแสนอร่อย ทำให้การรับประทานชาบูที่บ้านเป็นประสบการณ์ที่พิเศษยิ่งขึ้น",
              "product_size": 1000,
              "price": 116,
              "product_image": "https://fakeimg.pl/544x468/"
            }
          ]
        }
      ]
    }
  ]
}
